---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.OriginatingElementId
source: html/f1571d1a-7b10-af0e-cc0b-7872ed16eca2.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.OriginatingElementId Property

The element id for the originating Revit element.

## Syntax (C#)
```csharp
public LinkElementId OriginatingElementId { get; }
```